
#+TITLE: handpicking - Working with a reference buffer associated with current buffer
#+SUBTITLE: Development notes

#+PROPERTY: header-args  :results drawer
#+PROPERTY: header-args:elisp  :results value drawer

*** DONE Retrieve window displaying source buffer
    CLOSED: [2018-12-06 Thu 13:40]
    - help:get-buffer-window
#+BEGIN_SRC elisp
  (list
   (get-buffer-window "*scratch*")
   (get-buffer-window "handpicking.el")
   )
#+END_SRC

#+RESULTS:
:RESULTS:
(nil #<window 126 on handpicking.el>)
:END:

**** Using cyclic window ordering (next- previous- other-window)

     [[info:elisp#Cyclic%20Window%20Ordering][info:elisp#Cyclic Window Ordering]]
     This is what was used in 'rr/chatting-windows, rather satisfactory.
#+BEGIN_SRC elisp
  (list
   (previous-window)
   (next-window)
   )
#+END_SRC

#+RESULTS:
:RESULTS:
(#<window 176 on *Help*> #<window 126 on handpicking.el>)
:END:

**** reusing window
   - help:display-buffer
   - help:display-buffer-reuse-window
: (not (cdr (assq 'inhibit-same-window alist))))
#+BEGIN_SRC elisp
  (let (
        (wrk-w (selected-window))
        (wtd-buf "window.el.gz")
        destw
        rslt
        )
    (setq destw                           ; display-buffer returns the window
          (display-buffer
           wtd-buf
           '(display-buffer-reuse-window . ((inhibit-same-window . t)))
           )

          rslt                            ; user input to pause in current state
           (list destw
                 (y-or-n-p (format "Can you see '%s' ?" wtd-buf)))
           )
    (select-window wrk-w)                 ; re-select initial window
    rslt
    )
#+END_SRC

#+RESULTS:
:RESULTS:
(#<window 126 on window.el.gz> t)
:END:

So this works nearly as expected:
  - the desired buffer is displayed in next-window,
  - but afterwards comes back to initial window configuration.
    This might well be attributed to org-babel wrapper.
